@rohitsahu-rogers I have not been able to reproduce this crash. I used the following HCL with TF 1.6.2, provider 9.7.2, and Artifactory 7.68.3

```tf
# Required for Terraform 0.13 and up (https://www.terraform.io/upgrade-guides/0-13.html)
terraform {
  required_providers {
    artifactory = {
      source  = "registry.terraform.io/jfrog/artifactory"
      version = "9.7.3"
    }
  }
}

provider "artifactory" {
  //  supply ARTIFACTORY_ACCESS_TOKEN / JFROG_ACCESS_TOKEN / ARTIFACTORY_API_KEY and ARTIFACTORY_URL / JFROG_URL as env vars
}

resource "artifactory_local_docker_v2_repository" "test-docker-local" {
  key = "test-docker-local"
}

data "artifactory_local_docker_v2_repository" "test-docker-local" {
  key = artifactory_local_docker_v2_repository.test-docker-local.id
}

output "docker_api_version" {
  value = data.artifactory_local_docker_v2_repository.test-docker-local.api_version
}
```

And the output I got:

```sh
alexh@alexh-mac terraform-provider-artifactory % terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.artifactory_local_docker_v2_repository.test-docker-local will be read during apply
  # (config refers to values not yet known)
 <= data "artifactory_local_docker_v2_repository" "test-docker-local" {
      + api_version           = (known after apply)
      + block_pushing_schema1 = (known after apply)
      + id                    = (known after apply)
      + key                   = (known after apply)
      + package_type          = (known after apply)
      + project_environments  = (known after apply)
    }

  # artifactory_local_docker_v2_repository.test-docker-local will be created
  + resource "artifactory_local_docker_v2_repository" "test-docker-local" {
      + api_version           = (known after apply)
      + blacked_out           = false
      + block_pushing_schema1 = (known after apply)
      + cdn_redirect          = false
      + id                    = (known after apply)
      + includes_pattern      = "**/*"
      + key                   = "test-docker-local"
      + max_unique_tags       = 0
      + package_type          = (known after apply)
      + priority_resolution   = false
      + project_environments  = (known after apply)
      + repo_layout_ref       = "simple-default"
      + xray_index            = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + docker = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

artifactory_local_docker_v2_repository.test-docker-local: Creating...
artifactory_local_docker_v2_repository.test-docker-local: Creation complete after 1s [id=test-docker-local]
data.artifactory_local_docker_v2_repository.test-docker-local: Reading...
data.artifactory_local_docker_v2_repository.test-docker-local: Read complete after 0s [id=test-docker-local]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

docker = "test-docker-local"
alexh@alexh-mac terraform-provider-artifactory % terraform apply
artifactory_local_docker_v2_repository.test-docker-local: Refreshing state... [id=test-docker-local]
data.artifactory_local_docker_v2_repository.test-docker-local: Reading...
data.artifactory_local_docker_v2_repository.test-docker-local: Read complete after 0s [id=test-docker-local]

Changes to Outputs:
  - docker             = "test-docker-local" -> null
  + docker_api_version = "V2"

You can apply this plan to save these new output values to the Terraform state, without changing any real infrastructure.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes


Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

docker_api_version = "V2"
```